tutorials/extraTurbulenceModels/kOmegaSSTsust/alpha12/consistentSimpleFoam/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $velocity;

boundaryField
{
	"(top|bottom)"
    {
        type           fixedValue;
        value          uniform (0 0 0);
    }

    farfield
    {
        type           inletOutlet;
        inletValue     uniform $velocity;
    }

    frontback
    {
        type           empty;
    }

}


// ************************************************************************* //
